In [1]:
import numpy as np
import pandas as pd

#### numpy.concatenate

In [2]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [3]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

# 1.Series对象：

#### pandas.concat

In [4]:
s1 = pd.Series([0, 1, 2], index=["a", "b", "c"], dtype="Int64")
s2 = pd.Series([3, 4, 5], index=["c", "d", "e"], dtype="Int64")
s3 = pd.Series([6, 7], index=["f", "g"], dtype="Int64")

In [5]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
c    3
d    4
e    5
f    6
g    7
dtype: Int64

In [6]:
pd.concat([s1,s2,s3],axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c     2     3  <NA>
d  <NA>     4  <NA>
e  <NA>     5  <NA>
f  <NA>  <NA>     6
g  <NA>  <NA>     7

#### join

In [7]:
pd.concat([s1,s2],axis="columns",join="inner")

   0  1
c  2  3

#### keys

In [8]:
pd.concat([s1,s2,s3],keys=["one","two","three"])

one    a    0
       b    1
       c    2
two    c    3
       d    4
       e    5
three  f    6
       g    7
dtype: Int64

In [9]:
pd.concat([s1,s2,s3],axis="columns",keys=["one","two","three"])

    one   two  three
a     0  <NA>   <NA>
b     1  <NA>   <NA>
c     2     3   <NA>
d  <NA>     4   <NA>
e  <NA>     5   <NA>
f  <NA>  <NA>      6
g  <NA>  <NA>      7

# 2.DataFrame

In [10]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=["a", "b", "c"],columns=["one", "two"])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [11]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=["a", "c"],columns=["three", "four"])
df2

   three  four
a      5     6
c      7     8

In [12]:
pd.concat([df1,df2],axis="columns",keys=["L1","L2"])

   L1        L2
  one two three four
a   0   1   5.0  6.0
b   2   3   NaN  NaN
c   4   5   7.0  8.0

#### 传递一个字典对象，字典的键将用于 keys 参数

In [13]:
pd.concat({"L1":df1 , "L2":df2},axis="columns")

   L1        L2
  one two three four
a   0   1   5.0  6.0
b   2   3   NaN  NaN
c   4   5   7.0  8.0

#### names

In [14]:
pd.concat([df1,df2],axis="columns",keys=["L1","L2"],names=["一","二"])

一  L1        L2
二 one two three four
a   0   1   5.0  6.0
b   2   3   NaN  NaN
c   4   5   7.0  8.0

#### 行索引不包含任何相关数据的 DataFrame

In [15]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=["a", "b", "c"])
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [16]:
df2 = pd.DataFrame(np.arange(10,16).reshape((2,3)),columns=["b", "d", "a"])
df2

    b   d   a
0  10  11  12
1  13  14  15

In [17]:
pd.concat([df1,df2])

    a   b    c     d
0   0   1  2.0   NaN
1   3   4  5.0   NaN
2   6   7  8.0   NaN
0  12  10  NaN  11.0
1  15  13  NaN  14.0

In [18]:
pd.concat([df1,df2],ignore_index=True)

    a   b    c     d
0   0   1  2.0   NaN
1   3   4  5.0   NaN
2   6   7  8.0   NaN
3  12  10  NaN  11.0
4  15  13  NaN  14.0